In [1]:
import pandas as pd

In [2]:
data = [(1,2,3,4),
        (5,6,7,8),
        (8,10,11,12),
        (13,14,15,16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
#selecionando colunas
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [5]:
#seleciona todas colunas e linhas
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [6]:
#todas as linhas, excluindo a primeira
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [21]:
#seleciono excluindo a primeira, e depois da segunda linha
df[1:2]

    c1  c2  c3  c4
l2   5   6   7   8

In [12]:
#junto as duas formas de selecionar
df[1:3][['c2','c3']]

    c2  c3
l2   6   7
l3  10  11

In [13]:
#seleção por nome
df.loc[['l2','l4']]

    c1  c2  c3  c4
l2   5   6   7   8
l4  13  14  15  16

In [19]:
#selecionei um determinado elemento por nome
df.loc['l3','c3']

11

In [20]:
#por indice
df.iloc[0,1]

2

In [22]:
df.loc[['l3'], ['c4', 'c1']]

    c4  c1
l3  12   8